
public class Main {
    public static void main(String[] args) {
        /*
        Задача 1
        С помощью условного оператора напишите программу, которая выводит в консоль:
        сообщение о том, что человеку 18 или больше лет;
        сообщение, что возраст совершеннолетия еще не наступил, нужно немного подождать.
        При выполнении каждого условия программа должна выводить в консоль сообщение в формате:
        «Если возраст человека равен …, то (вывести в зависимости от результата) он совершеннолетний /
         он не достиг совершеннолетия, нужно немного подождать».
         */




        int a = 25;
        if (a<20) {
        System.out.println("Hello and welcome!");
        }
        else {
        System.out.println("hai");
        }
        boolean teacherIsHappy = false;
        if ( teacherIsHappy ) {
            System.out.println("Учитель доволен");
        } else { System.out.println(" прячь линейку! ");
        }


        }
        }